In [2]:
import pandas as pd

In [3]:
#Series
values = [10,20,30,40]
s = pd.Series(values, index=['a', 'b','c', 'd'])
s.loc['a']

#Data Frame:
df = pd.DataFrame({

    'name' : ['mike', 'bob' , 'Raj' ],
    'age' : [19, 20,18],
    'branch' : ['CSE', 'IT', 'DS']
})
df = df.set_index('name')
df

      age branch
name
mike   19    CSE
bob    20     IT
Raj    18     DS

In [5]:
df.at['bob', 'age']

np.int64(20)

In [7]:
df.at['bob' , 'age'] =70

In [8]:
df

      age branch
name
mike   19    CSE
bob    70     IT
Raj    18     DS

In [9]:
df.loc['john'] = [100, 'teacher']

In [10]:
df

      age   branch
name
mike   19      CSE
bob    70       IT
Raj    18       DS
john  100  teacher

In [11]:
df.iloc[0:2]

      age branch
name
mike   19    CSE
bob    70     IT

In [12]:
df.iloc[:2]

      age branch
name
mike   19    CSE
bob    70     IT